/*
Navicat PGSQL Data Transfer

Source Server         : pgsql
Source Server Version : 90502
Source Host           : localhost:5432
Source Database       : pg_test
Source Schema         : public

Target Server Type    : PGSQL
Target Server Version : 90502
File Encoding         : 65001

Date: 2016-12-30 18:33:26
*/


-- ----------------------------
-- Table structure for tags
-- ----------------------------
DROP TABLE IF EXISTS "public"."tags";
CREATE TABLE "public"."tags" (
"id" int4 DEFAULT nextval('tags_id_seq'::regclass) NOT NULL,
"name" varchar COLLATE "default",
"created_at" timestamp(6),
"updated_at" timestamp(6)
)
WITH (OIDS=FALSE)

;

-- ----------------------------
-- Records of tags
-- ----------------------------
INSERT INTO "public"."tags" VALUES ('0', '休闲', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('1', '解谜', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('2', '赛车竞速', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('3', '赛车', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('4', '驾驶', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('5', '射击', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('6', '角色', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('7', '动作', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('8', '卡牌', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('9', '回合', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('10', '跑酷', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('11', '格斗', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('12', '益智', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('13', '女生爱玩', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('14', '篮球', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('15', '摩托', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('16', '竞速', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('17', '模拟经营', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('18', '模拟飞行', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('19', '战斗', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('20', '机甲', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('21', '果宝', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('22', 'Q版', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('23', '冒险', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('24', '对战', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('25', '愤怒的小鸟', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('26', '即时策略', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('27', '养成', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('28', '剧情', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('29', '打发时间', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('30', '横版闯关', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('31', '僵尸', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('32', '战争', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('33', '科幻', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('34', '像素', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('35', '创意', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('36', '男生爱玩', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('37', '3D', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('38', 'CS', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('39', '体育', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('40', '放置', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('41', '策略', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('42', '塔防', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('43', '模拟', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('44', '三国', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('45', '火柴人', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('46', '体育运动', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('47', '奥特曼', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('48', '西游', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('49', '恐怖', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('50', '枪械', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('51', '驾驶飞机', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('52', '逼真', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('53', '防御射击', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('54', '动物', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('55', '恋爱', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('56', '火影', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('57', '节奏', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('58', '音乐', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('59', '漫画', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('60', '阅读', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('61', '拉力', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('62', '越野', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('63', '浏览器', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('64', '儿童', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('65', '饥饿鲨鱼', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('66', '捕食', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('67', '进化', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('68', '安全防护', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('69', '飞行', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('70', '消除', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('71', '超级大作', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('72', '武侠', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('73', '球类', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('74', '策略塔防', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('75', '移植', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('76', '动作格斗', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('77', '生存', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('78', '钓鱼', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('79', '文字', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('80', '大型RPG', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('81', '动漫', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('82', '滑雪', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('83', '搞笑', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('84', '排球', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('85', '改编', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('86', '传奇', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('87', '闯关', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('88', '捕鱼', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('89', '打飞机', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('90', '体育活动', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('91', '快艇', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('92', '逃脱', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('93', '运动', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('94', '小型RPG', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('95', '卡车', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('96', '益智休闲', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('97', '模拟驾驶', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('98', 'Dota', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('99', '足球', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('100', '拳击', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('101', '飞行模拟', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('102', '横板过关', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('103', '滑板', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('104', '二次元', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('105', '格斗飞行', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('106', '神话', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('107', '羽毛球', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('108', '战棋', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('109', '冒险解谜', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('110', '刀塔', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('111', '宠物', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');
INSERT INTO "public"."tags" VALUES ('112', '建设', '2016-12-30 16:15:28.685928', '2016-12-30 16:15:28.685928');

-- ----------------------------
-- Alter Sequences Owned By 
-- ----------------------------

-- ----------------------------
-- Primary Key structure for table tags
-- ----------------------------
ALTER TABLE "public"."tags" ADD PRIMARY KEY ("id");
